guozuqing/PX4-Autopilot/platforms/nuttx/src/px4/nxp/imxrt/hrt/hrt.c
/****************************************************************************
 *
 *   Copyright (c) 2018-2019 PX4 Development Team. All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Neither the name PX4 nor the names of its contributors may be
 *    used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 ****************************************************************************/

/**
 * @file hrt.c
 * Author: David Sidrane <david_s5@nscdg.com>
 *
 * High-resolution timer callouts and timekeeping.
 *
 * This can use any GPT timer.
 *
 * Note that really, this could use systick too, but that's
 * monopolised by NuttX and stealing it would just be awkward.
 *
 * We don't use the NuttX Kinetis driver per se; rather, we
 * claim the timer and then drive it directly.
 */

#include <px4_platform_common/px4_config.h>
#include <systemlib/px4_macros.h>
#include <nuttx/arch.h>
#include <nuttx/irq.h>

#include <sys/types.h>
#include <stdbool.h>

#include <assert.h>
#include <debug.h>
#include <time.h>
#include <queue.h>
#include <errno.h>
#include <string.h>
#include <syslog.h>

#include <board_config.h>
#include <drivers/drv_hrt.h>

/* HRT_PPM_QTIMER is defined in board_config.h for QTIMER-based PPM input */

#include "chip.h"
#include "hardware/imxrt_gpt.h"
#include "imxrt_periphclks.h"

#ifdef HRT_PPM_QTIMER
#include "hardware/imxrt_tmr.h"
#include "hardware/imxrt_memorymap.h"
#include "hardware/imxrt_iomuxc.h"
#include <stdio.h>
#include <syslog.h>
#include "arm_internal.h"  /* for putreg32/getreg32 */
#endif

#undef PPM_DEBUG

#ifdef CONFIG_DEBUG_HRT
#  define hrtinfo _info
#else
#  define hrtinfo(x...)
#endif

#define CAT3_(A, B, C)    A##B##C
#define CAT3(A, B, C)     CAT3_(A, B, C)

#ifdef HRT_TIMER

#define HRT_TIMER_FREQ   1000000

/* HRT configuration */

#define HRT_TIMER_CLOCK  BOARD_GPT_FREQUENCY                /* The input clock frequency to the GPT block */
#define HRT_TIMER_BASE   CAT3(IMXRT_GPT, HRT_TIMER,_BASE)   /* The Base address of the GPT */
#define HRT_TIMER_VECTOR CAT(IMXRT_IRQ_GPT, HRT_TIMER)      /* The GPT Interrupt vector */

#if HRT_TIMER == 1
#  define HRT_CLOCK_ALL()  imxrt_clockall_gpt_bus()         /* The Clock Gating macro for this GPT */
#elif HRT_TIMER == 2
#  define HRT_CLOCK_ALL()  imxrt_clockall_gpt2_bus()        /* The Clock Gating macro for this GPT */
#elif HRT_TIMER == 3
#  define HRT_CLOCK_ALL()  imxrt_clockall_gpt3_bus()        /* The Clock Gating macro for this GPT */
#elif HRT_TIMER == 4
#  define HRT_CLOCK_ALL()  imxrt_clockall_gpt4_bus()        /* The Clock Gating macro for this GPT */
#elif HRT_TIMER == 5
#  define HRT_CLOCK_ALL()  imxrt_clockall_gpt5_bus()        /* The Clock Gating macro for this GPT */
#elif HRT_TIMER == 6
#  define HRT_CLOCK_ALL()  imxrt_clockall_gpt6_bus()        /* The Clock Gating macro for this GPT */
#endif

#if HRT_TIMER == 1 && defined(CONFIG_IMXRT_GPT1)
#  error must not set CONFIG_IMXRT_GPT1=y and HRT_TIMER=1
#elif   HRT_TIMER == 2 && defined(CONFIG_IMXRT_GPT2)
#  error must not set CONFIG_IMXRT_GPT2=y and HRT_TIMER=2
#elif   HRT_TIMER == 3 && defined(CONFIG_IMXRT_GPT3)
#  error must not set CONFIG_IMXRT_GPT3=y and HRT_TIMER=3
#elif   HRT_TIMER == 4 && defined(CONFIG_IMXRT_GPT4)
#  error must not set CONFIG_IMXRT_GPT4=y and HRT_TIMER=4
#elif   HRT_TIMER == 5 && defined(CONFIG_IMXRT_GPT5)
#  error must not set CONFIG_IMXRT_GPT5=y and HRT_TIMER=5
#elif   HRT_TIMER == 6 && defined(CONFIG_IMXRT_GPT6)
#  error must not set CONFIG_IMXRT_GPT6=y and HRT_TIMER=6
#endif

/*
* HRT clock must be a multiple of 1MHz greater than 1MHz
*/
#if (HRT_TIMER_CLOCK % HRT_TIMER_FREQ) != 0
# error HRT_TIMER_CLOCK must be a multiple of 1MHz
#endif
#if HRT_TIMER_CLOCK <= HRT_TIMER_FREQ
# error HRT_TIMER_CLOCK must be greater than 1MHz
#endif

/**
* Minimum/maximum deadlines.
*
* These are suitable for use with a 32-bit timer/counter clocked
* at 1MHz.  The high-resolution timer need only guarantee that it
* not wrap more than once in the 4294.967296s period for absolute
* time to be consistently maintained.
*
* The minimum deadline must be such that the time taken between
* reading a time and writing a deadline to the timer cannot
* result in missing the deadline.
*/
#define HRT_INTERVAL_MIN	50
#define HRT_INTERVAL_MAX	 4294951760LL

/*
* Period of the free-running counter, in microseconds.
*/
#define HRT_COUNTER_PERIOD	4294967296LL

/*
* Scaling factor(s) for the free-running counter; convert an input
* in counts to a time in microseconds.
*/
#define HRT_COUNTER_SCALE(_c)	(_c)

/* Register accessors */

#define _REG(_addr)	(*(volatile uint32_t *)(_addr))

/* Timer register accessors */

#define REG(_reg)	_REG(HRT_TIMER_BASE + (_reg))

#define rCR         REG(IMXRT_GPT_CR_OFFSET)
#define rPR         REG(IMXRT_GPT_PR_OFFSET)
#define rSR         REG(IMXRT_GPT_SR_OFFSET)
#define rIR         REG(IMXRT_GPT_IR_OFFSET)
#define rOCR1       REG(IMXRT_GPT_OCR1_OFFSET)
#define rOCR2       REG(IMXRT_GPT_OCR2_OFFSET)
#define rOCR3       REG(IMXRT_GPT_OCR3_OFFSET)
#define rICR1       REG(IMXRT_GPT_ICR1_OFFSET)
#define rICR2       REG(IMXRT_GPT_ICR2_OFFSET)
#define rCNT        REG(IMXRT_GPT_CNT_OFFSET)

