guozuqing/PX4-Autopilot/platforms/nuttx/src/px4/nxp/imxrt/hrt/hrt.c
/*
* Specific registers and bits used by HRT sub-functions
*/

# define rOCR_HRT        CAT(rOCR, HRT_TIMER_CHANNEL)              /* GPT Output Compare Register used by HRT */
# define STATUS_HRT      CAT(GPT_SR_OF, HRT_TIMER_CHANNEL)         /* OF Output Compare Flag */
# define OFIE_HRT        CAT3(GPT_IR_OF, HRT_TIMER_CHANNEL,IE)     /* Output Compare Interrupt Enable */

#if (HRT_TIMER_CHANNEL < 1) || (HRT_TIMER_CHANNEL > 3)
#  error HRT_TIMER_CHANNEL must be a value between 1 and 3
#endif

/*
 * Queue of callout entries.
 */
static struct sq_queue_s  callout_queue;

/* latency baseline (last compare value applied) */
static uint32_t           latency_baseline;

/* timer count at interrupt (for latency purposes) */
static uint32_t           latency_actual;

/* latency histogram */
const uint16_t latency_bucket_count = LATENCY_BUCKET_COUNT;
const uint16_t latency_buckets[LATENCY_BUCKET_COUNT] = { 1, 2, 5, 10, 20, 50, 100, 1000 };
__EXPORT uint32_t latency_counters[LATENCY_BUCKET_COUNT + 1];

/* timer-specific functions */
static void hrt_tim_init(void);
static int  hrt_tim_isr(int irq, void *context, void *args);
static void hrt_latency_update(void);

/* callout list manipulation */
static void hrt_call_internal(struct hrt_call *entry, hrt_abstime deadline, hrt_abstime interval, hrt_callout callout,
			      void *arg);
static void hrt_call_enter(struct hrt_call *entry);
static void hrt_call_reschedule(void);
static void hrt_call_invoke(void);

#if !defined(HRT_PPM_CHANNEL) && !defined(HRT_PPM_QTIMER)

/* When HRT_PPM_CHANNEL is not used provide null operations */

#  define GPT_CR_IM_BOTH    0
#  define STATUS_PPM        0
#  define IFIE_PPM          0

#elif defined(HRT_PPM_CHANNEL) && !defined(HRT_PPM_QTIMER)

/* Specific registers and bits used by PPM sub-functions */

# define rICR_PPM        CAT(rICR, HRT_PPM_CHANNEL)               /* GPT Input Capture Register used by PPL */
# define GPT_CR_IM_BOTH  CAT3(GPT_CR_IM, HRT_PPM_CHANNEL, _BOTH)  /* GPT Capture mode both */
# define STATUS_PPM      CAT(GPT_SR_IF, HRT_PPM_CHANNEL)          /* IF Input capture  Flag */
# define IFIE_PPM        CAT3(GPT_IR_IF, HRT_PPM_CHANNEL,IE)     /* Output Compare Interrupt Enable */

/* Sanity checking */

#  if (HRT_PPM_CHANNEL != 1) && (HRT_PPM_CHANNEL != 2)
#     error HRT_PPM_CHANNEL must be a value of 1 or 2
#  endif

#   if (HRT_PPM_CHANNEL == HRT_TIMER_CHANNEL)
#     error HRT_PPM_CHANNEL must not be the same as HRT_TIMER_CHANNEL
#   endif

#elif defined(HRT_PPM_QTIMER)

/* QTIMER PPM configuration */

#define QTIMER_PPM_BASE          IMXRT_TMR1_BASE
#define QTIMER_PPM_TIMER         HRT_PPM_QTIMER
#define QTIMER_PPM_CHANNEL       HRT_PPM_QTIMER_CHANNEL
#define QTIMER_PPM_VECTOR        IMXRT_IRQ_QTIMER1
#define QTIMER_CH_OFFSET         0x20
#define QTIMER_CH_BASE(ch)       (QTIMER_PPM_BASE + ((ch) * QTIMER_CH_OFFSET))

/* QTIMER register accessors for PPM channel */
#define _REG16(_addr)            (*(volatile uint16_t *)(_addr))
#define QREG16(_reg)             _REG16(QTIMER_CH_BASE(QTIMER_PPM_CHANNEL) + (_reg))

#define rQTIMER_COMP1            QREG16(IMXRT_TMR_COMP1_OFFSET)
#define rQTIMER_COMP2            QREG16(IMXRT_TMR_COMP2_OFFSET)
#define rQTIMER_CAPT             QREG16(IMXRT_TMR_CAPT_OFFSET)
#define rQTIMER_LOAD             QREG16(IMXRT_TMR_LOAD_OFFSET)
#define rQTIMER_HOLD             QREG16(IMXRT_TMR_HOLD_OFFSET)
#define rQTIMER_CNTR             QREG16(IMXRT_TMR_CNTR_OFFSET)
#define rQTIMER_CTRL             QREG16(IMXRT_TMR_CTRL_OFFSET)
#define rQTIMER_SCTRL            QREG16(IMXRT_TMR_SCTRL_OFFSET)
#define rQTIMER_CMPLD1           QREG16(IMXRT_TMR_CMPLD1_OFFSET)
#define rQTIMER_CMPLD2           QREG16(IMXRT_TMR_CMPLD2_OFFSET)
#define rQTIMER_CSCTRL           QREG16(IMXRT_TMR_CSCTRL_OFFSET)
#define rQTIMER_FILT             QREG16(IMXRT_TMR_FILT_OFFSET)
#define rQTIMER_ENBL             _REG16(QTIMER_PPM_BASE + IMXRT_TMR_ENBL_OFFSET)

#define GPT_CR_IM_BOTH           0  /* Not used for QTIMER */
#define STATUS_PPM               TMR_SCTRL_IEF
#define IFIE_PPM                 TMR_SCTRL_IEFIE

#endif /* HRT_PPM_QTIMER */

#if defined(HRT_PPM_CHANNEL) || defined(HRT_PPM_QTIMER)
/*
 * PPM decoder tuning parameters
 */
#  define PPM_MIN_PULSE_WIDTH    200    /**< minimum width of a valid first pulse */
#  define PPM_MAX_PULSE_WIDTH    600    /**< maximum width of a valid first pulse */
#  define PPM_MIN_CHANNEL_VALUE  800    /**< shortest valid channel signal */
#  define PPM_MAX_CHANNEL_VALUE  2200   /**< longest valid channel signal */
#  define PPM_MIN_START          2300   /**< shortest valid start gap (only 2nd part of pulse) */

/* decoded PPM buffer */

#  define PPM_MIN_CHANNELS       5
#  define PPM_MAX_CHANNELS       20

/** Number of same-sized frames required to 'lock' */

#  define PPM_CHANNEL_LOCK       4 /**< should be less than the input timeout */

__EXPORT uint16_t ppm_buffer[PPM_MAX_CHANNELS];
__EXPORT uint16_t ppm_frame_length = 0;
__EXPORT unsigned ppm_decoded_channels = 0;
__EXPORT uint64_t ppm_last_valid_decode = 0;


#  if defined(PPM_DEBUG)

#    define EDGE_BUFFER_COUNT       32

/* PPM edge history */

__EXPORT uint32_t ppm_edge_history[EDGE_BUFFER_COUNT];
unsigned ppm_edge_next;

/* PPM pulse history */

__EXPORT uint32_t ppm_pulse_history[EDGE_BUFFER_COUNT];
unsigned ppm_pulse_next;
# endif

static uint32_t ppm_temp_buffer[PPM_MAX_CHANNELS];

/** PPM decoder state machine */
struct {
	uint32_t	last_edge;	/**< last capture time */
	uint32_t	last_mark;	/**< last significant edge */
	uint32_t	frame_start;	/**< the frame width */
	unsigned	next_channel;	/**< next channel index */
	enum {
		UNSYNCH = 0,
		ARM,
		ACTIVE,
		INACTIVE
	} phase;
} ppm;

#ifdef HRT_PPM_CHANNEL
static void	hrt_ppm_decode(uint32_t status);
#endif

#ifdef HRT_PPM_QTIMER
static void	qtimer_ppm_decode(uint16_t status);
#endif

#endif /* HRT_PPM_CHANNEL || HRT_PPM_QTIMER */

/**
 * Initialize the timer we are going to use.
 */
static void hrt_tim_init(void)
{
	/* Enable the Module clock */

	HRT_CLOCK_ALL();


	/* claim our interrupt vector */

	irq_attach(HRT_TIMER_VECTOR, hrt_tim_isr, NULL);

	/* disable and configure the timer */

	rCR = 0;

