guozuqing/PX4-Autopilot/platforms/nuttx/src/px4/nxp/imxrt/hrt/hrt.c
	rCR = GPT_CR_OM1_DIS | GPT_CR_OM2_DIS | GPT_CR_OM3_DIS |
	      GPT_CR_IM_BOTH | GPT_CR_FRR | GPT_CR_CLKSRC_IPG | GPT_CR_ENMOD;

	/* CLKSRC field is divided by [PRESCALER + 1] */

	rPR = (HRT_TIMER_CLOCK / HRT_TIMER_FREQ) - 1;

	/* set an initial capture a little ways off */

	rOCR_HRT  = 1000;

	/* enable interrupts */
	up_enable_irq(HRT_TIMER_VECTOR);

	rIR = IFIE_PPM | OFIE_HRT;

	/* enable the timer */

	rCR |= GPT_CR_EN;

}

#ifdef HRT_PPM_CHANNEL
/**
 * Handle the PPM decoder state machine.
 */
static void hrt_ppm_decode(uint32_t status)
{
	uint32_t count = rICR_PPM;
	uint32_t width;
	uint32_t interval;
	unsigned i;

	/* how long since the last edge? - this handles counter wrapping implicitly. */
	width = count - ppm.last_edge;

#if PPM_DEBUG
	ppm_edge_history[ppm_edge_next++] = width;

	if (ppm_edge_next >= EDGE_BUFFER_COUNT) {
		ppm_edge_next = 0;
	}

#endif

	/*
	 * if this looks like a start pulse, then push the last set of values
	 * and reset the state machine
	 */
	if (width >= PPM_MIN_START) {

		/*
		 * If the number of channels changes unexpectedly, we don't want
		 * to just immediately jump on the new count as it may be a result
		 * of noise or dropped edges.  Instead, take a few frames to settle.
		 */
		if (ppm.next_channel != ppm_decoded_channels) {
			static unsigned new_channel_count;
			static unsigned new_channel_holdoff;

			if (new_channel_count != ppm.next_channel) {
				/* start the lock counter for the new channel count */
				new_channel_count = ppm.next_channel;
				new_channel_holdoff = PPM_CHANNEL_LOCK;

			} else if (new_channel_holdoff > 0) {
				/* this frame matched the last one, decrement the lock counter */
				new_channel_holdoff--;

			} else {
				/* we have seen PPM_CHANNEL_LOCK frames with the new count, accept it */
				ppm_decoded_channels = new_channel_count;
				new_channel_count = 0;
			}

		} else {
			/* frame channel count matches expected, let's use it */
			if (ppm.next_channel >= PPM_MIN_CHANNELS) {
				for (i = 0; i < ppm.next_channel; i++) {
					ppm_buffer[i] = ppm_temp_buffer[i];
				}

				ppm_last_valid_decode = hrt_absolute_time();

			}
		}

		/* reset for the next frame */
		ppm.next_channel = 0;

		/* next edge is the reference for the first channel */
		ppm.phase = ARM;

		ppm.last_edge = count;
		return;
	}

	switch (ppm.phase) {
	case UNSYNCH:
		/* we are waiting for a start pulse - nothing useful to do here */
		break;

	case ARM:

		/* we expect a pulse giving us the first mark */
		if (width < PPM_MIN_PULSE_WIDTH || width > PPM_MAX_PULSE_WIDTH) {
			goto error;        /* pulse was too short or too long */
		}

		/* record the mark timing, expect an inactive edge */
		ppm.last_mark = ppm.last_edge;

		/* frame length is everything including the start gap */
		ppm_frame_length = (uint16_t)(ppm.last_edge - ppm.frame_start);
		ppm.frame_start = ppm.last_edge;
		ppm.phase = ACTIVE;
		break;

	case INACTIVE:

		/* we expect a short pulse */
		if (width < PPM_MIN_PULSE_WIDTH || width > PPM_MAX_PULSE_WIDTH) {
			goto error;        /* pulse was too short or too long */
		}

		/* this edge is not interesting, but now we are ready for the next mark */
		ppm.phase = ACTIVE;
		break;

	case ACTIVE:
		/* determine the interval from the last mark */
		interval = count - ppm.last_mark;
		ppm.last_mark = count;

#if PPM_DEBUG
		ppm_pulse_history[ppm_pulse_next++] = interval;

		if (ppm_pulse_next >= EDGE_BUFFER_COUNT) {
			ppm_pulse_next = 0;
		}

#endif

		/* if the mark-mark timing is out of bounds, abandon the frame */
		if ((interval < PPM_MIN_CHANNEL_VALUE) || (interval > PPM_MAX_CHANNEL_VALUE)) {
			goto error;
		}

		/* if we have room to store the value, do so */
		if (ppm.next_channel < PPM_MAX_CHANNELS) {
			ppm_temp_buffer[ppm.next_channel++] = interval;
		}

		ppm.phase = INACTIVE;
		break;

	}

	ppm.last_edge = count;
	return;

	/* the state machine is corrupted; reset it */

error:
	/* we don't like the state of the decoder, reset it and try again */
	ppm.phase = UNSYNCH;
	ppm_decoded_channels = 0;

}
#endif /* HRT_PPM_CHANNEL */

#ifdef HRT_PPM_QTIMER
/**
 * Initialize QTIMER for PPM input capture
 */
static void qtimer_ppm_init(void)
{
	syslog(LOG_INFO, "QTIMER_PPM_INIT: Starting initialization...\n");

	/* Enable QTIMER1 clock */
	imxrt_clockall_timer1();

	/* Disable timer during configuration */
	rQTIMER_ENBL &= ~(1 << QTIMER_PPM_CHANNEL);

	/* Manually configure IOMUX registers for GPIO_EMC_B2_12 as QTIMER1_TIMER3
	 * Using NuttX-defined register addresses
	 */
	/* Set MUX to ALT9 (QTIMER1_TIMER3) with SION=1 for input observation */
	putreg32(0x19, IMXRT_PADMUX_GPIO_EMC_B2_12);  /* ALT9 + SION */

	/* Configure PAD with strong pull-up
	 * Bits: PKE(12)=1, PUE(13)=1, PUS(15:14)=11b (100K ohm pull-up)
	 * DSE(3:1)=000 (disabled), FSEL(5:4)=00 (slow), ODE(11)=0 (no open drain)
	 */
	putreg32(0xB000, IMXRT_PADCTL_GPIO_EMC_B2_12);  /* 100K pull-up enabled */

	/* Configure SELECT_INPUT daisy chain - need to find the right register */
	/* For now set to 0 = select GPIO_EMC_B2_12 ALT9 as QTIMER1_TIMER3 input */
	#define IOMUXC_QTIMER1_TIMER3_SELECT_INPUT  (IMXRT_IOMUXC_BASE + 0x04E8)
	putreg32(0, IOMUXC_QTIMER1_TIMER3_SELECT_INPUT);

	/* Verify configuration */
	uint32_t mux_verify = getreg32(IMXRT_PADMUX_GPIO_EMC_B2_12);
	uint32_t pad_verify = getreg32(IMXRT_PADCTL_GPIO_EMC_B2_12);

	syslog(LOG_INFO, "QTIMER_PPM_INIT: MUX=0x%08lx PAD=0x%08lx\n", mux_verify, pad_verify);

	if ((pad_verify & 0xB000) != 0xB000) {
		syslog(LOG_WARNING, "QTIMER_PPM_INIT: PAD pull-up not set! PAD=0x%08lx\n", pad_verify);
	}

	/* Reset control register */
	rQTIMER_CTRL = 0;

	/* Configure QTIMER for free-running counter with input capture
	 * - Count mode: Count rising edges of primary source (MODE1)
	 * - Primary source: IP bus clock / 1 (150 MHz) - provides time base
	 * - Input capture: Monitor external pin for edges (via SCTRL.CAPTURE_MODE)
	 * - LENGTH: Count until compare, then reload to 0 (free-running)
	 */
	rQTIMER_CTRL = TMR_CTRL_CM_MODE1 |       /* Count rising edges of primary */
	               TMR_CTRL_PCS_DIV1 |        /* Primary: IP bus clock / 1 (150 MHz) */
	               TMR_CTRL_LENGTH;           /* Count until compare, then reload */
	/* Note: SCS not used for input capture - SCTRL.CAPTURE_MODE controls capture */

	/* Configure input capture on external pin (TIMER3 input)
	 * - Capture on both rising and falling edges
	 * - Each edge triggers: CAPT = current counter, IEF = 1, interrupt
	 */
	rQTIMER_SCTRL = TMR_SCTRL_CAPTURE_BOTH |  /* Capture both edges of input pin */
	                TMR_SCTRL_IEFIE;           /* Enable input edge interrupt */

	/* Set compare value to maximum for free-running (16-bit counter) */
	rQTIMER_COMP1 = 0xFFFF;
	rQTIMER_COMP2 = 0xFFFF;

	/* Load initial value */
	rQTIMER_LOAD = 0;

	/* Clear any pending flags */
	rQTIMER_SCTRL |= TMR_SCTRL_IEF | TMR_SCTRL_TCF | TMR_SCTRL_TOF;

