guozuqing/PX4-Autopilot/platforms/nuttx/src/px4/nxp/imxrt/hrt/hrt.c
	/* Enable QTIMER channel */
	rQTIMER_ENBL |= (1 << QTIMER_PPM_CHANNEL);

	/* Attach and enable QTIMER interrupt */
	irq_attach(QTIMER_PPM_VECTOR, hrt_tim_isr, NULL);
	up_enable_irq(QTIMER_PPM_VECTOR);

	/* Force output to console - use printf to ensure visibility */
	printf("\n*** QTIMER PPM INIT ***\n");
	printf("QTIMER%d CH%d for PPM on GPIO_EMC_B2_12\n", QTIMER_PPM_TIMER, QTIMER_PPM_CHANNEL);
	printf("IRQ=%d, Base=0x%08lx\n", QTIMER_PPM_VECTOR, (unsigned long)QTIMER_PPM_BASE);
	printf("CTRL=0x%04x, SCTRL=0x%04x, ENBL=0x%04x\n", rQTIMER_CTRL, rQTIMER_SCTRL, rQTIMER_ENBL);
	printf("*** QTIMER INIT DONE ***\n\n");
}

/**
 * Handle QTIMER PPM decoder state machine
 */
static void qtimer_ppm_decode(uint16_t status)
{
	/* First call notification */
	static bool first_call = true;
	if (first_call) {
		first_call = false;
		_info("*** QTIMER PPM decoder first call! status=0x%04x ***\n", status);
	}

	/* Read captured value - reading HOLD automatically captures CAPT */
	uint16_t count = rQTIMER_HOLD;

	/* Handle 16-bit counter overflow to create virtual 32-bit timestamp */
	static uint16_t last_count = 0;
	static uint32_t overflow_count = 0;

	if (count < last_count) {
		/* Counter wrapped around (16-bit overflow) */
		overflow_count++;
	}
	last_count = count;

	/* Create 32-bit timestamp from overflow count and current count
	 * QTIMER runs at 150 MHz, convert to microseconds: count / 150
	 * To avoid floating point: (count * 1000) / 150 = (count * 20) / 3
	 */
	uint32_t count_us = ((uint32_t)count * 20) / 3;
	uint32_t overflow_us = (overflow_count * 65536UL * 20) / 3;
	uint32_t absolute_time_us = overflow_us + count_us;

	/* Calculate pulse width */
	uint32_t width = absolute_time_us - ppm.last_edge;
	uint32_t interval;
	unsigned i;

#if PPM_DEBUG
	ppm_edge_history[ppm_edge_next++] = width;
	if (ppm_edge_next >= EDGE_BUFFER_COUNT) {
		ppm_edge_next = 0;
	}
#endif

	/* Check for start pulse (frame sync) */
	if (width >= PPM_MIN_START) {
		/* Handle channel count changes */
		if (ppm.next_channel != ppm_decoded_channels) {
			static unsigned new_channel_count;
			static unsigned new_channel_holdoff;

			if (new_channel_count != ppm.next_channel) {
				new_channel_count = ppm.next_channel;
				new_channel_holdoff = PPM_CHANNEL_LOCK;
			} else if (new_channel_holdoff > 0) {
				new_channel_holdoff--;
			} else {
				ppm_decoded_channels = new_channel_count;
				new_channel_count = 0;
			}
		} else {
			if (ppm.next_channel >= PPM_MIN_CHANNELS) {
				for (i = 0; i < ppm.next_channel; i++) {
					ppm_buffer[i] = ppm_temp_buffer[i];
				}
				ppm_last_valid_decode = hrt_absolute_time();
			}
		}

		ppm.next_channel = 0;
		ppm.phase = ARM;
		ppm.last_edge = absolute_time_us;
		return;
	}

	switch (ppm.phase) {
	case UNSYNCH:
		break;

	case ARM:
		if (width < PPM_MIN_PULSE_WIDTH || width > PPM_MAX_PULSE_WIDTH) {
			goto error;
		}
		ppm.last_mark = ppm.last_edge;
		ppm_frame_length = (uint16_t)(ppm.last_edge - ppm.frame_start);
		ppm.frame_start = ppm.last_edge;
		ppm.phase = ACTIVE;
		break;

	case INACTIVE:
		if (width < PPM_MIN_PULSE_WIDTH || width > PPM_MAX_PULSE_WIDTH) {
			goto error;
		}
		ppm.phase = ACTIVE;
		break;

	case ACTIVE:
		interval = absolute_time_us - ppm.last_mark;
		ppm.last_mark = absolute_time_us;

#if PPM_DEBUG
		ppm_pulse_history[ppm_pulse_next++] = interval;
		if (ppm_pulse_next >= EDGE_BUFFER_COUNT) {
			ppm_pulse_next = 0;
		}
#endif

		if ((interval < PPM_MIN_CHANNEL_VALUE) || (interval > PPM_MAX_CHANNEL_VALUE)) {
			goto error;
		}

		if (ppm.next_channel < PPM_MAX_CHANNELS) {
			ppm_temp_buffer[ppm.next_channel++] = interval;
		}

		ppm.phase = INACTIVE;
		break;
	}

	ppm.last_edge = absolute_time_us;
	return;

error:
	ppm.phase = UNSYNCH;
	ppm_decoded_channels = 0;
}
#endif /* HRT_PPM_QTIMER */

/**
 * Handle the compare interrupt by calling the callout dispatcher
 * and then re-scheduling the next deadline.
 */
static int
hrt_tim_isr(int irq, void *context, void *arg)
{
#ifdef HRT_PPM_QTIMER
	/* Check if this is QTIMER PPM interrupt */
	if (irq == QTIMER_PPM_VECTOR) {
		uint16_t qtimer_status = rQTIMER_SCTRL;

		/* Debug: increment interrupt counter */
		static uint32_t qtimer_irq_count = 0;
		qtimer_irq_count++;

		/* Check for input edge flag */
		if (qtimer_status & STATUS_PPM) {
			/* Clear the interrupt flag */
			rQTIMER_SCTRL |= STATUS_PPM;

			/* Decode PPM signal */
			qtimer_ppm_decode(qtimer_status);
		}

		/* Log first few interrupts for debugging */
		if (qtimer_irq_count <= 10) {
			printf("QTIMER IRQ #%lu: status=0x%04x, HOLD=0x%04x\n",
			       (unsigned long)qtimer_irq_count, qtimer_status, rQTIMER_HOLD);
		}

		return OK;
	}
#endif

	/* grab the timer for latency tracking purposes */

	latency_actual = rCNT;

	/* copy interrupt status */
	uint32_t status = rSR;

	/* ack the interrupts we just read */

	rSR = status;

#ifdef HRT_PPM_CHANNEL

	/* was this a PPM edge? */
	if (status & (STATUS_PPM)) {
		hrt_ppm_decode(status);
	}

#endif

	/* was this a timer tick? */
	if (status & STATUS_HRT) {

		/* do latency calculations */
		hrt_latency_update();

		/* run any callouts that have met their deadline */
		hrt_call_invoke();

		/* and schedule the next interrupt */
		hrt_call_reschedule();
	}

	return OK;
}

/**
 * Fetch a never-wrapping absolute time value in microseconds from
 * some arbitrary epoch shortly after system start.
 */
hrt_abstime
hrt_absolute_time(void)
{
	hrt_abstime	abstime;
	uint32_t	count;
	irqstate_t	flags;

	/*
	 * Counter state.  Marked volatile as they may change
	 * inside this routine but outside the irqsave/restore
	 * pair.  Discourage the compiler from moving loads/stores
	 * to these outside of the protected range.
	 */
	static volatile hrt_abstime base_time;
	static volatile uint32_t last_count;

#ifdef HRT_PPM_QTIMER
	/* Debug: Report QTIMER status once after system is stable */
	static uint32_t call_count = 0;
	if (++call_count == 1000) {
		_info("=== QTIMER STATUS (after 1000 calls) ===\n");
		_info("QTIMER Base=0x%08lx\n", (unsigned long)QTIMER_PPM_BASE);
		_info("CTRL=0x%04x, SCTRL=0x%04x, ENBL=0x%04x\n",
		      rQTIMER_CTRL, rQTIMER_SCTRL, rQTIMER_ENBL);
		_info("CNTR=0x%04x, HOLD=0x%04x\n", rQTIMER_CNTR, rQTIMER_HOLD);
		_info("=== END QTIMER STATUS ===\n");
	}
#endif

